In [ ]:
# !pip install ipython-sql

In [1]:
%load_ext sql
%sql sqlite:///db.db3

In [2]:
%%sql
create table vendors (vend_id int, vend_name varchar(50));
insert into vendors values (101, 'Apple'), (102, 'Samsung'), (103, 'Xiaomi');

 * sqlite:///db.db3
Done.
3 rows affected.

[]

In [3]:
%%sql
create table products (prod_id int, prod_name varchar(50), vend_id int);
insert into products values (201, 'iPhone', 101), (202, 'Galaxy', 102), (203, 'Zalaxy', 102);

 * sqlite:///db.db3
Done.
3 rows affected.

[]

In [4]:
%sql select * from products, vendors --simple equijoin syntax

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple'),
 (201, 'iPhone', 101, 102, 'Samsung'),
 (201, 'iPhone', 101, 103, 'Xiaomi'),
 (202, 'Galaxy', 102, 101, 'Apple'),
 (202, 'Galaxy', 102, 102, 'Samsung'),
 (202, 'Galaxy', 102, 103, 'Xiaomi'),
 (203, 'Zalaxy', 102, 101, 'Apple'),
 (203, 'Zalaxy', 102, 102, 'Samsung'),
 (203, 'Zalaxy', 102, 103, 'Xiaomi')]

In [5]:
%sql select * from products inner join vendors --ansi inner join syntax

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple'),
 (201, 'iPhone', 101, 102, 'Samsung'),
 (201, 'iPhone', 101, 103, 'Xiaomi'),
 (202, 'Galaxy', 102, 101, 'Apple'),
 (202, 'Galaxy', 102, 102, 'Samsung'),
 (202, 'Galaxy', 102, 103, 'Xiaomi'),
 (203, 'Zalaxy', 102, 101, 'Apple'),
 (203, 'Zalaxy', 102, 102, 'Samsung'),
 (203, 'Zalaxy', 102, 103, 'Xiaomi')]

In [6]:
%sql select * from products, vendors where products.vend_id = vendors.vend_id

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple'),
 (202, 'Galaxy', 102, 102, 'Samsung'),
 (203, 'Zalaxy', 102, 102, 'Samsung')]

In [7]:
%sql select * from products inner join vendors on products.vend_id = vendors.vend_id

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple'),
 (202, 'Galaxy', 102, 102, 'Samsung'),
 (203, 'Zalaxy', 102, 102, 'Samsung')]

In [8]:
%sql select * from products inner join vendors --join

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple'),
 (201, 'iPhone', 101, 102, 'Samsung'),
 (201, 'iPhone', 101, 103, 'Xiaomi'),
 (202, 'Galaxy', 102, 101, 'Apple'),
 (202, 'Galaxy', 102, 102, 'Samsung'),
 (202, 'Galaxy', 102, 103, 'Xiaomi'),
 (203, 'Zalaxy', 102, 101, 'Apple'),
 (203, 'Zalaxy', 102, 102, 'Samsung'),
 (203, 'Zalaxy', 102, 103, 'Xiaomi')]

In [9]:
%sql select * from products left outer join vendors --left join

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple'),
 (201, 'iPhone', 101, 102, 'Samsung'),
 (201, 'iPhone', 101, 103, 'Xiaomi'),
 (202, 'Galaxy', 102, 101, 'Apple'),
 (202, 'Galaxy', 102, 102, 'Samsung'),
 (202, 'Galaxy', 102, 103, 'Xiaomi'),
 (203, 'Zalaxy', 102, 101, 'Apple'),
 (203, 'Zalaxy', 102, 102, 'Samsung'),
 (203, 'Zalaxy', 102, 103, 'Xiaomi')]

In [10]:
%sql select * from products inner join vendors on products.vend_id = vendors.vend_id

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple'),
 (202, 'Galaxy', 102, 102, 'Samsung'),
 (203, 'Zalaxy', 102, 102, 'Samsung')]

In [11]:
%sql select * from vendors left join products on products.vend_id = vendors.vend_id

 * sqlite:///db.db3
Done.

[(101, 'Apple', 201, 'iPhone', 101),
 (102, 'Samsung', 202, 'Galaxy', 102),
 (102, 'Samsung', 203, 'Zalaxy', 102),
 (103, 'Xiaomi', None, None, None)]

In [12]:
%sql select * from products, vendors where products.vend_id = vendors.vend_id and vend_name = 'Apple'

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple')]

In [13]:
%sql select * from products inner join vendors on products.vend_id = vendors.vend_id and vend_name = 'Apple'

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple')]

In [14]:
%sql select * from products as p1 inner join products as p2 --self join

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 201, 'iPhone', 101),
 (201, 'iPhone', 101, 202, 'Galaxy', 102),
 (201, 'iPhone', 101, 203, 'Zalaxy', 102),
 (202, 'Galaxy', 102, 201, 'iPhone', 101),
 (202, 'Galaxy', 102, 202, 'Galaxy', 102),
 (202, 'Galaxy', 102, 203, 'Zalaxy', 102),
 (203, 'Zalaxy', 102, 201, 'iPhone', 101),
 (203, 'Zalaxy', 102, 202, 'Galaxy', 102),
 (203, 'Zalaxy', 102, 203, 'Zalaxy', 102)]

In [15]:
%sql select * from products as p1 inner join products as p2 where p1.prod_id <> p2.prod_id

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 202, 'Galaxy', 102),
 (201, 'iPhone', 101, 203, 'Zalaxy', 102),
 (202, 'Galaxy', 102, 201, 'iPhone', 101),
 (202, 'Galaxy', 102, 203, 'Zalaxy', 102),
 (203, 'Zalaxy', 102, 201, 'iPhone', 101),
 (203, 'Zalaxy', 102, 202, 'Galaxy', 102)]